#+TITLE:
#+DATE:
#+AUTHOR:
#+EMAIL:
#+OPTIONS: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+OPTIONS: author:t c:nil creator:nil d:(not "LOGBOOK") date:nil e:t
#+OPTIONS: email:nil f:t inline:t num:t p:nil pri:nil prop:nil stat:t
#+OPTIONS: tags:nil tasks:t tex:t timestamp:t title:t toc:nil todo:t |:t
#+LANGUAGE: en
#+SELECT_TAGS: export
#+EXCLUDE_TAGS: noexport
#+LATEX_CLASS:thesis
#+STARTUP: hideblocks
# +STARTUP: latexpreview

#+BEGIN_EXPORT latex
%% Use these commands to set biographic information for the title page:
\title{Enabling Novel IGRT Imaging Trajectories with Optimization-Based Reconstruction Algorithms}
\author{Andrew Davis}
\department{Committee on Medical Physics}
\division{Biological Sciences}
\degree{Ph. D.}
\date{August, 2017}

%% Use these commands to set a dedication and epigraph text
\dedication{Dedication Text}
\epigraph{Epigraph Text}

% If you don't want a title page comment out the next line and uncomment the line after it:
\maketitle
%\omittitle

% These lines can be commented out to disable the copyright/dedication/epigraph pages
\makecopyright
\makededication
\makeepigraph

%% Make the various tables of contents
\tableofcontents
\listoffigures
\listoftables

\acknowledgments

Funding was provided in part by Varian Medical Systems, the Lawrence
H. Lanzl Fellowship (to A. D.), and NIH Grants R01 CA182264, R01
EB018102, S10 RR021039 and P30 CA14599. We are grateful to Pascal
Paysan and Dieter Seghers (also Varian) for providing and assisting
with the iTools Reconstruction software. The contents of this work are
solely the responsibility of the authors and do not necessarily
represent the official view of any of the supporting organizations.
The authors have no relevant conflicts of interest to disclose.

\abstract
% Enter Abstract here

\mainmatter
% Main body of text follows
#+END_EXPORT

****** itools analyis
       :PROPERTIES:
       :ID:       bc6df6dd-13e6-4bc5-826c-2002d54ab552
       :END:
  Contrast analysis for catphan

 #+BEGIN_SRC python :results output
import dicom
import numpy as np
import matplotlib.pyplot as plt

from phantoms import lcr

from IPython.core.debugger import Tracer
debug_here = Tracer()

catphan_dcm = dicom.read_file(('itools/161213_catphan_circ_1p5x_ringrem/IMG_0042.dcm'))
catphan_hu = catphan_dcm.pixel_array*catphan_dcm.RescaleSlope+catphan_dcm.RescaleIntercept

itools_lcr = lcr.CatphanLowContrast(catphan_hu, xres=0.473, x0=121.8/0.473,
                                    y0=121.6/0.473, z=0, rot=-3.48, hu=True)

itools_lcr.save_contrast_calcs('data/', 'catphan_circular_itools')

# itools_lcr.show_rod_locs(vmin=-60, vmax=60)
# plt.savefig('figures/catphan_itools_lcr_locs.png')
# return('figures/catphan_itools_lcr_locs.png')
print(itools_lcr.contrast_1_0)
print(itools_lcr.contrast_0_5)
print(itools_lcr.contrast_0_3)
 #+END_SRC

 #+RESULTS:
 #+begin_example
              % contrast  % contrast sigma       cnr  cnr sigma
rod diameter
15.0            1.273217          1.022240  1.236393   1.414493
9.0             1.157174          1.021059  1.100177   1.415368
8.0             0.767365          1.017061  0.898154   1.437275
7.0             1.198443          1.021447  1.296850   1.420209
6.0             0.486577          1.014224  0.484239   1.414228
5.0             0.860374          1.018018  0.881201   1.415018
4.0             0.763490          1.017019  0.933650   1.452495
3.0             0.356576          1.012901  0.589711   1.701662
2.0             1.844718          1.027938  2.757142   1.586562
              % contrast  % contrast sigma       cnr  cnr sigma
rod diameter
15.0            0.501931          1.033669  0.492042   1.414261
9.0             0.094065          1.029462  0.093504   1.414567
8.0             0.392379          1.032535  0.429770   1.425485
7.0            -0.057559          1.027902  0.061673   1.421552
6.0             0.466486          1.033301  0.477422   1.416169
5.0             0.405244          1.032665  0.482771   1.449648
4.0            -0.082372          1.027647  0.091132   1.427591
3.0            -0.630458          1.022024  0.675272   1.421494
2.0            -0.591860          1.022407  0.984642   1.735271
              % contrast  % contrast sigma       cnr  cnr sigma
rod diameter
15.0            0.162203          0.979250  0.181559   1.420491
9.0            -0.001550          0.977648  0.001615   1.414454
8.0             0.488048          0.982444  0.519364   1.415367
7.0             0.614937          0.983694  0.624087   1.414256
6.0             0.189741          0.979519  0.207107   1.417398
5.0             1.030511          0.987745  1.524829   1.548857
4.0             0.985444          0.987344  1.008152   1.414214
3.0             0.322520          0.980822  0.318188   1.415103
2.0            -0.096169          0.976723  0.107345   1.420092
 #+end_example
****** recon em analysis
       :PROPERTIES:
       :ID:       73598a41-2659-4be4-8473-9086ba73c896
       :END:
 Results from my reconstructions

 #+BEGIN_SRC python :results output
import glob
import numpy as np
import matplotlib.pyplot as plt

from phantoms import lcr

from IPython.core.debugger import Tracer
debug_here = Tracer()

# get files we have
dir = "/home/amdavis/research/truebeam/150902_virtiso_cbct_catphan_ed/itools/img/"
files = sorted(glob.glob(dir+"*catphan*itools*{0:04d}*.raw".format(iter)))

catphan_circular = np.fromfile(files[0], 'f').reshape(125, 528, 528).swapaxes(1, 2).T
catphan_virtiso = np.fromfile(files[1], 'f').reshape(125, 528, 528).swapaxes(1, 2).T

catphan_circular = catphan_circular[...,
                                    int(catphan_circular.shape[2]/2)]
catphan_virtiso = catphan_virtiso[...,
                                  int(catphan_virtiso.shape[2]/2)]

circular_lcr = lcr.CatphanLowContrast(catphan_circular, xres=0.473,
                                      x0=263.5, y0=261.5, z=0, rot=-3.,
                                      hu=False)

virtiso_lcr = lcr.CatphanLowContrast(catphan_virtiso, xres=0.473,
                                     x0=272, y0=259.5, z=0, rot=-3.,
                                     hu=False)

circular_lcr.save_contrast_calcs('data/', 'catphan_circular_mlem_iter_{0:03d}'.format(iter))
virtiso_lcr.save_contrast_calcs('data/', 'catphan_virtiso_mlem_iter_{0:03d}'.format(iter))

# circ_fig = circular_lcr.show_rod_locs(vmin=0.02, vmax=0.021)
# virt_fig = virtiso_lcr.show_rod_locs(vmin=0.019, vmax=0.021)

# circ_fig.savefig('figures/catphan_circular_mlem_lcr_locs.png')
# virt_fig.savefig('figures/catphan_virtiso_mlem_lcr_locs.png')
# return('figures/catphan_circular_mlem_lcr_locs.png')
# return('figures/virtiso_circular_mlem_lcr_locs.png')

print("\n0.3% circular")
print(circular_lcr.contrast_0_3)
print("\n0.3% virtiso")
print(virtiso_lcr.contrast_0_3)

print("\n0.5% circular")
print(circular_lcr.contrast_0_5)
print("\n0.5% virtiso")
print(virtiso_lcr.contrast_0_5)

print("\n1.0% circular")
print(circular_lcr.contrast_1_0)
print("\n1.0% virtiso")
print(virtiso_lcr.contrast_1_0)
 #+END_SRC

 #+RESULTS:
 #+begin_example

0.3% circular
      % contrast  % contrast sigma       cnr  cnr sigma
15.0    0.336178          0.632722  0.757847   1.423412
9.0     0.292402          0.669551  0.619270   1.415762
8.0     0.131968          0.623152  0.302362   1.426568
7.0     0.431134          0.613007  1.009752   1.431675
6.0     0.290603          0.656327  0.628716   1.417611
5.0     0.422215          0.665411  0.900781   1.416314
4.0     0.155166          0.543975  0.431161   1.509609
3.0    -0.297085          0.688549  0.609311   1.414347
2.0     0.472236          0.741477  0.903903   1.416268

0.3% virtiso
      % contrast  % contrast sigma       cnr  cnr sigma
15.0    0.382718          0.830310  0.658319   1.424841
9.0     0.092026          0.799518  0.165280   1.435069
8.0    -0.107992          0.868174  0.176177   1.417189
7.0    -0.103785          0.786340  0.190046   1.440932
6.0    -0.309173          0.774152  0.576760   1.447345
5.0    -0.309976          0.759113  0.594024   1.458054
4.0    -0.223083          1.130837  0.282885   1.435041
3.0    -0.471983          0.698019  1.039611   1.543806
2.0    -1.038081          0.691397  2.308892   1.551891

0.5% circular
      % contrast  % contrast sigma       cnr  cnr sigma
15.0    0.335700          0.647368  0.735412   1.415590
9.0     0.015566          0.591873  0.037623   1.430468
8.0     0.560906          0.624661  1.278832   1.419516
7.0     0.200324          0.689673  0.411264   1.414540
6.0    -0.258247          0.630936  0.579385   1.417608
5.0     0.550274          0.624253  1.255414   1.419604
4.0     0.465531          0.577228  1.165342   1.440343
3.0     0.078896          0.601583  0.187137   1.426210
2.0    -0.371316          0.476344  1.444140   1.859480

0.5% virtiso
      % contrast  % contrast sigma       cnr  cnr sigma
15.0   -0.323800          0.992989  0.467154   1.435720
9.0    -0.265211          0.949907  0.405867   1.456524
8.0     0.103588          0.939622  0.161663   1.465258
7.0     0.500131          0.977952  0.741149   1.444188
6.0     0.876336          0.922225  1.421072   1.485184
5.0     0.751536          0.897809  1.275159   1.513860
4.0     0.118879          0.984507  0.174040   1.440150
3.0     1.058663          1.008137  1.516077   1.433655
2.0     0.703962          0.820208  1.728628   2.000000

1.0% circular
      % contrast  % contrast sigma       cnr  cnr sigma
15.0    0.891881          0.658649  1.933036   1.420049
9.0     0.723097          0.732432  1.401420   1.414637
8.0     0.697721          0.628473  1.594919   1.430160
7.0     0.958346          0.679275  2.008902   1.416360
6.0     0.700465          0.639470  1.568403   1.425579
5.0     0.878039          0.685795  1.821070   1.415579
4.0     0.613320          0.672501  1.296906   1.417139
3.0     0.315199          0.567085  0.827869   1.485735
2.0     0.664848          0.506692  2.641720   2.000000

1.0% virtiso
      % contrast  % contrast sigma       cnr  cnr sigma
15.0    1.216002          0.926873  1.869765   1.415754
9.0     0.418370          0.884876  0.673363   1.420661
8.0     1.236294          0.892132  1.982379   1.420123
7.0     0.963466          0.803941  1.755233   1.454411
6.0     1.147464          0.792635  2.137994   1.464240
5.0     0.164518          0.983530  0.236795   1.414503
4.0    -0.124803          0.796152  0.227947   1.455467
3.0    -0.180899          0.874025  0.294034   1.422201
2.0    -1.164900          0.681244  2.957545   1.749484
 #+end_example
